ErpTest/src/AccumulationRegisters/ФактическиеДанныеБюджетирования/ФактическиеДанныеБюджетирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ФактическиеДанныеБюджетирования</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяБюджетов</name>
    <type>
      <types>CatalogRef.СтатьиБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.ПравилаПолученияФактаПоСтатьямБюджетов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/ОборотыБюджетов/ОборотыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборотыБюджетов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаСценария</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПланов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджетов</name>
    <type>
      <types>CatalogRef.СтатьиБюджетов</types>
      <types>CatalogRef.ПоказателиБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/ФактическиеДанныеБюджетирования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)
	|	И ЗначениеРазрешено(СтатьяБюджетов)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

#Область ОбработчикиОбновления_2_4_2

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрНакопления.ФактическиеДанныеБюджетирования";
	
	ПустыеЗначенияДляОбработки = БюджетированиеВызовСервера.ЗаменяемыеПустыеЗначенияАналитики();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
		|	Таблица.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ФактическиеДанныеБюджетирования КАК Таблица
		|ГДЕ
		|	(Таблица.Аналитика1 В (&ПустыеЗначенияДляОбработки)
		|			ИЛИ Таблица.Аналитика2 В (&ПустыеЗначенияДляОбработки)
		|			ИЛИ Таблица.Аналитика3 В (&ПустыеЗначенияДляОбработки)
		|			ИЛИ Таблица.Аналитика4 В (&ПустыеЗначенияДляОбработки)
		|			ИЛИ Таблица.Аналитика5 В (&ПустыеЗначенияДляОбработки)
		|			ИЛИ Таблица.Аналитика6 В (&ПустыеЗначенияДляОбработки))";
	
	Запрос.УстановитьПараметр("ПустыеЗначенияДляОбработки", ПустыеЗначенияДляОбработки);
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Регистраторы, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.ФактическиеДанныеБюджетирования;
	ПолноеИмяРегистра = МетаданныеРегистра.ПолноеИмя();
	
	ПустыеЗначенияДляОбработки = БюджетированиеВызовСервера.ЗаменяемыеПустыеЗначенияАналитики();
	МаксимальноеКоличествоАналитик = БюджетированиеКлиентСервер.МаксимальноеКоличествоАналитик();
	ЗначениеЗамены = БюджетированиеКлиентСервер.ПустоеЗначениеАналитики();
	
	РеквизитыПоиска = Новый Массив;
	Для Сч = 1 По МаксимальноеКоличествоАналитик Цикл
		РеквизитыПоиска.Добавить("Аналитика" + Сч);
	КонецЦикла;
	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	ТипыДокументовКОбработке = ТипыДокументовКОбработке();
	
	Для Каждого ПолноеИмяДокумента Из ТипыДокументовКОбработке Цикл
		
		Выборка = ОбновлениеИнформационнойБазы.ВыбратьРегистраторыРегистраДляОбработки(Параметры.Очередь, ПолноеИмяДокумента, ПолноеИмяРегистра);
		
		Пока Выборка.Следующий() Цикл
			
			Регистратор = Выборка.Регистратор;
			
			НачатьТранзакцию();
			
			Попытка
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
				ЭлементБлокировки.УстановитьЗначение("Регистратор", Регистратор);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				
				Блокировка.Заблокировать();
				
				Набор = РегистрыНакопления.ОборотыБюджетов.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Регистратор);
				Набор.Прочитать();
				
				Если Набор.Количество() = 0 Тогда
					
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Регистратор, ДополнительныеПараметры);
					
				Иначе
					
					ОбъектИзменен = Ложь;
					
					Для каждого Запись Из Набор Цикл
						
						БюджетированиеВызовСервера.ВыполнитьЗаменыЗначенийВОбъекте(Запись,
						                                                           РеквизитыПоиска,
						                                                           ПустыеЗначенияДляОбработки,
						                                                           ЗначениеЗамены,
						                                                           ОбъектИзменен);
						
					КонецЦикла;
					
					Если ОбъектИзменен Тогда
						ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
					Иначе
						ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Регистратор, ДополнительныеПараметры);
					КонецЕсли;
					
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТекстСообщения = НСтр("ru = 'Не удалось обработать документ: %Регистратор% по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Регистратор%", Регистратор);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				Регистратор.Метаданные(),
				ТекстСообщения);
				
			КонецПопытки;
			
		КонецЦикла;
		
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

Функция ТипыДокументовКОбработке()
	
	МассивТипов = Новый Массив;
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.ФактическиеДанныеБюджетирования;
	ТипыРегистраторов = МетаданныеРегистра.СтандартныеРеквизиты.Регистратор.Тип.Типы();
	
	Для каждого ТипРегистратора Из ТипыРегистраторов Цикл
		
		МетаданныеРегистратора = Метаданные.НайтиПоТипу(ТипРегистратора);
		МассивТипов.Добавить(МетаданныеРегистратора.ПолноеИмя());
		
	КонецЦикла;
	
	Возврат МассивТипов;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
